<?php
//+----------------------------------------------------|
// | Description: index.php
// +---------------------------------------------------|
// | Author: 浩丶IMOYH [oyhemail@163.com]
// | Last Modified: 2018/8/2
//+----------------------------------------------------|

## ============================= ##
## 初始化
## ============================= ##
## 数据容器
$viewData = [];
## 引入公共文件
include '_common.php';


## ============================= ##
## 常规逻辑部分
## ============================= ##


## 判断错误的链接访问
if($uri['url']) include '404.php';




## ============================= ##
## 自定义逻辑部分
## ============================= ##

## 数据入栈
$viewData['say'] =  'hello digoodcms';





## 生成SEO代码
$seoInfoHtml = seoInfo();
$viewData['seoInfoHtml'] = $seoInfoHtml;


## ============================= ##
## 加载视图文件
## ============================= ##
loadView('index',$viewData);


